import { useQuery } from '@tanstack/react-query';
import { fetchTweets } from '@/services/api/tweetsApi';

// Хук useTweetsQuery використовується для отримання списку твітів з сервера з використанням React Query.
// Він приймає параметр state, який визначає, які твіти потрібно отримати: "all" - всі твіти, "follow" - ті, що стосуються підписок,
// "isFollowed" - ті, які є відстежуваними. Залежно від значення state, будуть отримані відповідні твіти з сервера.

export const useTweetsQuery = state => {
  return useQuery({
    // queryFn - функція, яка буде виконана для отримання даних з сервера.
    // У даному випадку, вона викликає функцію fetchTweets з параметром state, щоб отримати відповідні твіти.
    queryFn: () => fetchTweets(state),

    // queryKey - ключ запиту, який визначає, до яких даних відноситься цей запит.
    // В даному випадку, використовується масив з двома значеннями: "tweets" - означає, що це запит для списку твітів,
    // і значення state - вказує на те, які твіти потрібно отримати (всі, ті, що стосуються підписок або відстежувані).

    queryKey: ['tweets', state],

    // staleTime - час, протягом якого дані будуть вважатися "свіжими" і не будуть перезавантажуватися з сервера.
    // У даному випадку, дані будуть вважатися свіжими протягом 5 секунд (1000 мілісекунд = 1 секунда).

    staleTime: 1000 * 5,
  });
};
